{"backend": "tensorflow", "config": {"layers": [{"config": {"activation": "relu", "data_format": "channels_last", "name": "conv2d", "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "batch_input_shape": [null, 1, 20, 5], "padding": "same", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "filters": 12, "kernel_constraint": null, "strides": [1, 1], "use_bias": true, "trainable": true, "dtype": "float32"}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "data_format": "channels_last", "name": "conv2d_1", "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "padding": "same", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "filters": 20, "kernel_constraint": null, "strides": [1, 1], "use_bias": true, "trainable": true, "dtype": "float32"}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "data_format": "channels_last", "name": "conv2d_2", "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "padding": "same", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "filters": 20, "kernel_constraint": null, "strides": [1, 1], "use_bias": true, "trainable": true, "dtype": "float32"}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "data_format": "channels_last", "name": "conv2d_3", "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "padding": "same", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "filters": 12, "kernel_constraint": null, "strides": [1, 1], "use_bias": true, "trainable": true, "dtype": "float32"}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "name": "max_pooling2d", "padding": "same", "pool_size": [3, 3], "strides": [3, 3], "trainable": true, "dtype": "float32"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout", "rate": 0.5, "seed": null, "dtype": "float32", "noise_shape": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"data_format": "channels_last", "name": "flatten", "trainable": true, "dtype": "float32"}, "class_name": "Flatten"}, {"config": {"activation": "relu", "name": "dense", "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "activity_regularizer": null, "units": 10, "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_constraint": null, "trainable": true, "dtype": "float32"}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "dense_1", "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "activity_regularizer": null, "units": 10, "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_constraint": null, "trainable": true, "dtype": "float32"}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "dense_2", "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "activity_regularizer": null, "units": 10, "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_constraint": null, "trainable": true, "dtype": "float32"}, "class_name": "Dense"}, {"config": {"activation": "softmax", "name": "dense_3", "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "activity_regularizer": null, "units": 4, "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_constraint": null, "trainable": true, "dtype": "float32"}, "class_name": "Dense"}], "name": "sequential"}, "keras_version": "2.2.4-tf", "class_name": "Sequential"}