{"class_name": "Sequential", "keras_version": "2.2.4-tf", "backend": "tensorflow", "config": {"name": "sequential", "layers": [{"class_name": "Conv2D", "config": {"dtype": "float32", "kernel_regularizer": null, "filters": 12, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "trainable": true, "activation": "relu", "kernel_size": [3, 3], "name": "conv2d", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "batch_input_shape": [null, 1, 20, 5], "padding": "same", "bias_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1]}}, {"class_name": "Conv2D", "config": {"dtype": "float32", "kernel_regularizer": null, "filters": 20, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "trainable": true, "activation": "relu", "kernel_size": [3, 3], "name": "conv2d_1", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "padding": "same", "bias_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1]}}, {"class_name": "Conv2D", "config": {"dtype": "float32", "kernel_regularizer": null, "filters": 20, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "trainable": true, "activation": "relu", "kernel_size": [3, 3], "name": "conv2d_2", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "padding": "same", "bias_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1]}}, {"class_name": "Conv2D", "config": {"dtype": "float32", "kernel_regularizer": null, "filters": 12, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "trainable": true, "activation": "relu", "kernel_size": [3, 3], "name": "conv2d_3", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "padding": "same", "bias_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d", "data_format": "channels_last", "pool_size": [3, 3], "dtype": "float32", "strides": [3, 3], "trainable": true, "padding": "same"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout", "seed": null, "rate": 0.5, "dtype": "float32", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "data_format": "channels_last", "dtype": "float32"}}, {"class_name": "Dense", "config": {"dtype": "float32", "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "activation": "relu", "name": "dense", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "bias_constraint": null, "bias_regularizer": null, "units": 10, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"dtype": "float32", "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "activation": "relu", "name": "dense_1", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "bias_constraint": null, "bias_regularizer": null, "units": 10, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"dtype": "float32", "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "activation": "relu", "name": "dense_2", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "bias_constraint": null, "bias_regularizer": null, "units": 10, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"dtype": "float32", "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "activation": "softmax", "name": "dense_3", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "bias_constraint": null, "bias_regularizer": null, "units": 4, "activity_regularizer": null}}]}}