{"config": {"output_layers": [["dense_3", 0, 0]], "name": "model_1", "layers": [{"name": "input_2", "config": {"sparse": false, "batch_input_shape": [null, 20, 20, 1], "name": "input_2", "dtype": "float32"}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "zero_padding2d_1", "config": {"dtype": "float32", "padding": [[0, 0], [1, 1]], "name": "zero_padding2d_1", "data_format": "channels_last", "trainable": true}, "inbound_nodes": [[["input_2", 0, 0, {}]]], "class_name": "ZeroPadding2D"}, {"name": "input_1", "config": {"sparse": false, "batch_input_shape": [null, 128, 46, 1], "name": "input_1", "dtype": "float32"}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "conv2d_3", "config": {"activation": "linear", "filters": 16, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "dtype": "float32", "padding": "same", "bias_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": 1, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_3", "use_bias": true}, "inbound_nodes": [[["zero_padding2d_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv2d_1", "config": {"activation": "linear", "filters": 6, "kernel_size": [5, 5], "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "dtype": "float32", "padding": "valid", "bias_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": 1, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_1", "use_bias": true}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "batch_normalization_3", "config": {"beta_regularizer": null, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "dtype": "float32", "momentum": 0.99, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "beta_constraint": null, "axis": 3, "name": "batch_normalization_3", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "batch_normalization_1", "config": {"beta_regularizer": null, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "dtype": "float32", "momentum": 0.99, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "beta_constraint": null, "axis": 3, "name": "batch_normalization_1", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "activation_3", "config": {"dtype": "float32", "name": "activation_3", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "class_name": "Activation"}, {"name": "activation_1", "config": {"dtype": "float32", "name": "activation_1", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "class_name": "Activation"}, {"name": "max_pooling2d_3", "config": {"name": "max_pooling2d_3", "data_format": "channels_last", "trainable": true, "dtype": "float32", "padding": "valid", "pool_size": [2, 2], "strides": [2, 2]}, "inbound_nodes": [[["activation_3", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "max_pooling2d_1", "config": {"name": "max_pooling2d_1", "data_format": "channels_last", "trainable": true, "dtype": "float32", "padding": "valid", "pool_size": [2, 2], "strides": [2, 2]}, "inbound_nodes": [[["activation_1", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "conv2d_4", "config": {"activation": "linear", "filters": 32, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "dtype": "float32", "padding": "same", "bias_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": 1, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_4", "use_bias": true}, "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv2d_2", "config": {"activation": "linear", "filters": 16, "kernel_size": [5, 5], "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "dtype": "float32", "padding": "valid", "bias_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": 1, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_2", "use_bias": true}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "batch_normalization_4", "config": {"beta_regularizer": null, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "dtype": "float32", "momentum": 0.99, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "beta_constraint": null, "axis": 3, "name": "batch_normalization_4", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "batch_normalization_2", "config": {"beta_regularizer": null, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "dtype": "float32", "momentum": 0.99, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "beta_constraint": null, "axis": 3, "name": "batch_normalization_2", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "activation_4", "config": {"dtype": "float32", "name": "activation_4", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "class_name": "Activation"}, {"name": "activation_2", "config": {"dtype": "float32", "name": "activation_2", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "class_name": "Activation"}, {"name": "max_pooling2d_4", "config": {"name": "max_pooling2d_4", "data_format": "channels_last", "trainable": true, "dtype": "float32", "padding": "valid", "pool_size": [2, 2], "strides": [2, 2]}, "inbound_nodes": [[["activation_4", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "max_pooling2d_2", "config": {"name": "max_pooling2d_2", "data_format": "channels_last", "trainable": true, "dtype": "float32", "padding": "valid", "pool_size": [2, 2], "strides": [2, 2]}, "inbound_nodes": [[["activation_2", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "flatten_2", "config": {"dtype": "float32", "name": "flatten_2", "data_format": "channels_last", "trainable": true}, "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]], "class_name": "Flatten"}, {"name": "flatten_1", "config": {"dtype": "float32", "name": "flatten_1", "data_format": "channels_last", "trainable": true}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "Flatten"}, {"name": "concatenate_1", "config": {"dtype": "float32", "axis": -1, "name": "concatenate_1", "trainable": true}, "inbound_nodes": [[["flatten_2", 0, 0, {}], ["flatten_1", 0, 0, {}]]], "class_name": "Concatenate"}, {"name": "dense_1", "config": {"kernel_regularizer": null, "bias_constraint": null, "trainable": true, "activation": "relu", "name": "dense_1", "activity_regularizer": null, "units": 10, "dtype": "float32", "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "class_name": "Dense"}, {"name": "dense_2", "config": {"kernel_regularizer": null, "bias_constraint": null, "trainable": true, "activation": "relu", "name": "dense_2", "activity_regularizer": null, "units": 10, "dtype": "float32", "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Dense"}, {"name": "dense_3", "config": {"kernel_regularizer": null, "bias_constraint": null, "trainable": true, "activation": "softmax", "name": "dense_3", "activity_regularizer": null, "units": 4, "dtype": "float32", "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["dense_2", 0, 0, {}]]], "class_name": "Dense"}], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]]}, "backend": "tensorflow", "class_name": "Model", "keras_version": "2.3.1"}